tutorials/fsiFoam/3dTube_test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       45800;
    }
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       46000;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       46200;
    }
    symmetry-x
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          1200;
        startFace       47800;
    }
    symmetry-y
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          1200;
        startFace       49000;
    }
)

// ************************************************************************* //
