tutorials/fsiFoam/3dTube_test/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/solid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       17200;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       17280;
    }
    inner-wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       17360;
    }
    outer-wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       18960;
    }
    symmetry-x
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          320;
        startFace       20560;
    }
    symmetry-y
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          320;
        startFace       20880;
    }
)

// ************************************************************************* //
