tutorials/fsiFoam/3dTube_test/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidSolidInterface    weakCoupling;//IQNILS;

//IQNILSCoeffs
weakCouplingCoeffs
{
    solidPatch         inner-wall;
    solidZone          inner-wall-zone;

    fluidPatch         walls;
    fluidZone          wall-zone;

    relaxationFactor   0.05;

    interfaceDeformationLimit 0;

    outerCorrTolerance 1e-6;

    nOuterCorr         30;

    interpolatorUpdateFrequency 1;

    couplingReuse       1;

    coupled             yes;
    coupledStartTime    0.1;
}

// ************************************************************************* //
