tutorials/fsiFoam/3dTube_test/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    symmetry-x
    {
        type        symmetry;
    }
    symmetry-y
    {
        type        symmetry;
    }
    outlet
    {
        type        fixedValue;
        value       uniform 0;
    }
    inlet
    {
	type zeroGradient;//
    }
    walls
    {
        type       extrapolatedPressure;
        value      uniform 0;
    }


// ************************************************************************* //
